# Description
Common and important pandas operations that I must master for day-to-day oeprations

In [9]:
import numpy as np 
import pandas as pd

# Replace values based on conditions with `where()` and `mask()`
Perform conditional operations like 'if then...' or 'if then...else...' on Dataframe or Series

* `where()`: is used to replace values where conditions is `False`
* `mask()`: is used to replace values where conditions is `True`
* `np.where()`: for replacing both True and False

## `where()`: replaces `False`, keep `True` unchanged

### `where()` applied to a series

In [2]:
s = pd.Series([-2, -1, 0,1,2])
s

0   -2
1   -1
2    0
3    1
4    2
dtype: int64

where(): true values remain unchanged, while false values become NaN

In [3]:
s.where(s<0)

0   -2.0
1   -1.0
2    NaN
3    NaN
4    NaN
dtype: float64

replace false value with `other`

In [4]:
s.where(s<0, 10)

0    -2
1    -1
2    10
3    10
4    10
dtype: int64

array-like objects (e.g. list or numpy array-ndarray) can also be specified
, false values are replaced with the corresponding elements in these objects

In [5]:
s.where(s<0, [0,10,20,30,40])

0    -2
1    -1
2    20
3    30
4    40
dtype: int64

it's also possible to apply a process to the original series for replacement

In [6]:
s * 100 + 10

0   -190
1    -90
2     10
3    110
4    210
dtype: int64

In [7]:
s.where(s<0, s*100+10)

0     -2
1     -1
2     10
3    110
4    210
dtype: int64

By default, a new object is returned without changing the original object. If the argument `inplace` is set to True, the original object is updated

### `where()` applied to a dataframe

In [10]:
df = pd.DataFrame({'A': [-2, -1, 0, 1, 2], 
                   'B': [0, 10, 20, 30, 40]})
df

   A   B
0 -2   0
1 -1  10
2  0  20
3  1  30
4  2  40

note that using `and`, `or`, instead of the bitwise operator `&`, `|`, will result in an error

In [11]:
df.where((df < 0) | (df>20))

     A     B
0 -2.0   NaN
1 -1.0   NaN
2  NaN   NaN
3  NaN  30.0
4  NaN  40.0

replace False value with others

In [12]:
df.where((df < 0) | (df>20), 200)

     A    B
0   -2  200
1   -1  200
2  200  200
3  200   30
4  200   40

In [14]:
df * 100 + 10

     A     B
0 -190    10
1  -90  1010
2   10  2010
3  110  3010
4  210  4010

In [13]:
df.where((df < 0) | (df > 20), df * 100 + 10)

     A     B
0   -2    10
1   -1  1010
2   10  2010
3  110    30
4  210    40

Process specific columns in dataframe

In [15]:
df['C'] = ['A','B','C','D','E']
df

   A   B  C
0 -2   0  A
1 -1  10  B
2  0  20  C
3  1  30  D
4  2  40  E

In [17]:
# can also add as a mew column
df['D'] = df['C'].where(df['A']<0, 'X')
df

   A   B  C  D
0 -2   0  A  A
1 -1  10  B  B
2  0  20  C  X
3  1  30  D  X
4  2  40  E  X

You can also only extract and process only numeric columns and then concatenate them with non-numeric columns, using the `select_dtypes()` method and the `pd.concat()` function

In [18]:
df.dtypes

A     int64
B     int64
C    object
D    object
dtype: object

In [20]:
df_num = df.select_dtypes('number')
df_num.where(df_num>0, -10)

    A   B
0 -10 -10
1 -10  10
2 -10  20
3   1  30
4   2  40

In [21]:
df.select_dtypes(exclude='number')

   C  D
0  A  A
1  B  B
2  C  X
3  D  X
4  E  X

In [22]:
pd.concat([df_num.where(df_num > 0, -10), df.select_dtypes(exclude='number')], axis=1)

    A   B  C  D
0 -10 -10  A  A
1 -10  10  B  B
2 -10  20  C  X
3   1  30  D  X
4   2  40  E  X

## `mask()` replaces True, keep False unchanged

### `mask()` applied to a series

In [23]:
s = pd.Series(['Alice', 'Bob', 'Charlie', 'Dave', 'Ellen'])
s

0      Alice
1        Bob
2    Charlie
3       Dave
4      Ellen
dtype: object

In [24]:
s.mask(s.str.endswith('e'))

0      NaN
1      Bob
2      NaN
3      NaN
4    Ellen
dtype: object

In [25]:
s.mask(s.str.endswith('e'), 'X')

0        X
1      Bob
2        X
3        X
4    Ellen
dtype: object

In [26]:
s.mask(s.str.endswith('e'), s.str.upper())

0      ALICE
1        Bob
2    CHARLIE
3       DAVE
4      Ellen
dtype: object

### `mask()` applied to a Dataframe

In [37]:
df = pd.DataFrame({'A': [-2, -1, 0, 1, 2], 
                   'B': [0, 10, 20, 30, 40]})
df

   A   B
0 -2   0
1 -1  10
2  0  20
3  1  30
4  2  40

In [38]:
df.mask(df<10, 1)

   A   B
0  1   1
1  1  10
2  1  20
3  1  30
4  1  40

In [39]:
df['C'] = ['A','B','C','D','E']
df

   A   B  C
0 -2   0  A
1 -1  10  B
2  0  20  C
3  1  30  D
4  2  40  E

In [42]:
df['C'].mask(df['A']<0, 'X')

0    X
1    X
2    C
3    D
4    E
Name: C, dtype: object

In [35]:
df['D'] = df['C'].mask(df['A']<0, 'X')
df

   A   B  C  D
0 -2   0  A  X
1 -1  10  B  X
2  0  20  C  C
3  1  30  D  D
4  2  40  E  E

## `np.where()` replace both True and False

np.where(condition, replacement for True, replacement for False)

In [44]:
s = pd.Series([-2, -1, 0, 1, 2])
s

0   -2
1   -1
2    0
3    1
4    2
dtype: int64

In [45]:
np.where(s<0, s*10, s*100+10)

array([-20, -10,  10, 110, 210])

In [50]:
df = pd.DataFrame({
    'A': [-2,-1,0,1,2],
    'B': [0,10,20,30,40]
})
df

   A   B
0 -2   0
1 -1  10
2  0  20
3  1  30
4  2  40

In [51]:
np.where((df<0) | (df>20), -100, 1)

array([[-100,    1],
       [-100,    1],
       [   1,    1],
       [   1, -100],
       [   1, -100]])

notes: `np.where()` returns a numpy array `ndarray`. Using the index and columns attributes of the original DataFrame or Series, you can generate a new one

In [52]:
pd.Series(np.where(s<0, s*10, s*100+10), index=s.index)

0    -20
1    -10
2     10
3    110
4    210
dtype: int64

In [53]:
pd.DataFrame(np.where((df<0) | (df>20), -100, 1), 
            index=df.index, columns=df.columns)

     A    B
0 -100    1
1 -100    1
2    1    1
3    1 -100
4    1 -100